{"format": "keras", "nodes": [{"name": "input_layer", "id": "input_layer", "class_name": "InputLayer", "output_shape": [[null, 64, 64, 4]], "num_parameters": 0}, {"name": "conditional_noise_layer_2", "id": "conditional_noise_layer_2", "class_name": "ConditionalNoiseLayer", "output_shape": [null, 64, 64, 4], "num_parameters": 0}, {"name": "preproc_norm", "id": "preproc_norm", "class_name": "TrainingTimeNormalization", "output_shape": [null, 64, 64, 4], "num_parameters": 9}, {"name": "clouds_layer_2", "id": "clouds_layer_2", "class_name": "CloudsLayer", "output_shape": [null, 64, 64, 4], "num_parameters": 0}, {"name": "model_2", "id": "model_2", "class_name": "Functional", "output_shape": [null, 576], "num_parameters": 186272}, {"name": "dense_1", "id": "dense_1", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 577}, {"name": "leaky_re_lu_1", "id": "leaky_re_lu_1", "class_name": "LeakyReLU", "output_shape": [null, 1], "num_parameters": 0}], "edges": [["input_layer", "conditional_noise_layer_2"], ["conditional_noise_layer_2", "preproc_norm"], ["preproc_norm", "clouds_layer_2"], ["clouds_layer_2", "model_2"], ["model_2", "dense_1"], ["dense_1", "leaky_re_lu_1"]]}