{"format": "keras", "nodes": [{"name": "input_layer", "id": "input_layer", "class_name": "InputLayer", "output_shape": [[null, 64, 64, 4]], "num_parameters": 0}, {"name": "conditional_noise_layer_6", "id": "conditional_noise_layer_6", "class_name": "ConditionalNoiseLayer", "output_shape": [null, 64, 64, 4], "num_parameters": 0}, {"name": "norm_layer", "id": "norm_layer", "class_name": "TrainingTimeNormalization", "output_shape": [null, 64, 64, 4], "num_parameters": 9}, {"name": "cloud_layer", "id": "cloud_layer", "class_name": "CloudsLayer", "output_shape": [null, 64, 64, 4], "num_parameters": 0}, {"name": "model_6", "id": "model_6", "class_name": "Functional", "output_shape": [null, 576], "num_parameters": 186272}, {"name": "dense_2", "id": "dense_2", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 577}, {"name": "leaky_re_lu_2", "id": "leaky_re_lu_2", "class_name": "LeakyReLU", "output_shape": [null, 1], "num_parameters": 0}], "edges": [["input_layer", "conditional_noise_layer_6"], ["conditional_noise_layer_6", "norm_layer"], ["norm_layer", "cloud_layer"], ["cloud_layer", "model_6"], ["model_6", "dense_2"], ["dense_2", "leaky_re_lu_2"]]}