{"format": "keras", "nodes": [{"name": "input_layer", "id": "input_layer", "class_name": "InputLayer", "output_shape": [[null, 64, 64, 3]], "num_parameters": 0}, {"name": "conditional_noise_layer_2", "id": "conditional_noise_layer_2", "class_name": "ConditionalNoiseLayer", "output_shape": [null, 64, 64, 3], "num_parameters": 0}, {"name": "norm_layer", "id": "norm_layer", "class_name": "TrainingTimeNormalization", "output_shape": [null, 64, 64, 3], "num_parameters": 7}, {"name": "model_3", "id": "model_3", "class_name": "Functional", "output_shape": [null, 576], "num_parameters": 185984}, {"name": "dense_1", "id": "dense_1", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 577}, {"name": "leaky_re_lu_1", "id": "leaky_re_lu_1", "class_name": "LeakyReLU", "output_shape": [null, 1], "num_parameters": 0}], "edges": [["input_layer", "conditional_noise_layer_2"], ["conditional_noise_layer_2", "norm_layer"], ["norm_layer", "model_3"], ["model_3", "dense_1"], ["dense_1", "leaky_re_lu_1"]]}