{"format": "keras", "nodes": [{"name": "input_7", "id": "input_7", "class_name": "InputLayer", "output_shape": [[null, 64, 64, 4]], "num_parameters": 0}, {"name": "cloud_layer", "id": "cloud_layer", "class_name": "CloudsLayer", "output_shape": [null, 64, 64, 4], "num_parameters": 0}, {"name": "model_14", "id": "model_14", "class_name": "Functional", "output_shape": [null, 576], "num_parameters": 186272}, {"name": "dense_3", "id": "dense_3", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 577}, {"name": "leaky_re_lu_3", "id": "leaky_re_lu_3", "class_name": "LeakyReLU", "output_shape": [null, 1], "num_parameters": 0}], "edges": [["cloud_layer", "model_14"], ["input_7", "model_14"], ["model_14", "dense_3"], ["model_14", "dense_3"], ["dense_3", "leaky_re_lu_3"], ["dense_3", "leaky_re_lu_3"]]}