{"format": "keras", "nodes": [{"name": "input_layer", "id": "input_layer", "class_name": "InputLayer", "output_shape": [[null, 64, 64, 4]], "num_parameters": 0}, {"name": "conditional_noise_layer_1", "id": "conditional_noise_layer_1", "class_name": "ConditionalNoiseLayer", "output_shape": [null, 64, 64, 4], "num_parameters": 0}, {"name": "norm_layer", "id": "norm_layer", "class_name": "TrainingTimeNormalization", "output_shape": [null, 64, 64, 4], "num_parameters": 9}, {"name": "cloud_layer", "id": "cloud_layer", "class_name": "CloudsLayer", "output_shape": [null, 64, 64, 4], "num_parameters": 0}, {"name": "model", "id": "model", "class_name": "Functional", "output_shape": [null, 576], "num_parameters": 186272}, {"name": "dense", "id": "dense", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 577}, {"name": "leaky_re_lu", "id": "leaky_re_lu", "class_name": "LeakyReLU", "output_shape": [null, 1], "num_parameters": 0}], "edges": [["input_layer", "conditional_noise_layer_1"], ["conditional_noise_layer_1", "norm_layer"], ["norm_layer", "cloud_layer"], ["cloud_layer", "model"], ["model", "dense"], ["dense", "leaky_re_lu"]]}