{"format": "keras", "nodes": [{"name": "input_12", "id": "input_12", "class_name": "InputLayer", "output_shape": [[null, 64, 64, 4]], "num_parameters": 0}, {"name": "norm_layer", "id": "norm_layer", "class_name": "TrainingTimeNormalization", "output_shape": [null, 64, 64, 4], "num_parameters": 9}, {"name": "cloud_layer", "id": "cloud_layer", "class_name": "CloudsLayer", "output_shape": [null, 64, 64, 4], "num_parameters": 0}, {"name": "model_28", "id": "model_28", "class_name": "Functional", "output_shape": [null, 576], "num_parameters": 186272}, {"name": "dense_6", "id": "dense_6", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 577}, {"name": "leaky_re_lu_6", "id": "leaky_re_lu_6", "class_name": "LeakyReLU", "output_shape": [null, 1], "num_parameters": 0}], "edges": [["norm_layer", "cloud_layer"], ["input_12", "cloud_layer"], ["cloud_layer", "model_28"], ["cloud_layer", "model_28"], ["model_28", "dense_6"], ["model_28", "dense_6"], ["dense_6", "leaky_re_lu_6"], ["dense_6", "leaky_re_lu_6"]]}