{"format": "keras", "nodes": [{"name": "input_9", "id": "input_9", "class_name": "InputLayer", "output_shape": [[null, 64, 64, 4]], "num_parameters": 0}, {"name": "norm_layer", "id": "norm_layer", "class_name": "TrainingTimeNormalization", "output_shape": [null, 64, 64, 4], "num_parameters": 9}, {"name": "cloud_layer", "id": "cloud_layer", "class_name": "CloudsLayer", "output_shape": [null, 64, 64, 4], "num_parameters": 0}, {"name": "model_18", "id": "model_18", "class_name": "Functional", "output_shape": [null, 576], "num_parameters": 186272}, {"name": "dense_4", "id": "dense_4", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 577}, {"name": "leaky_re_lu_4", "id": "leaky_re_lu_4", "class_name": "LeakyReLU", "output_shape": [null, 1], "num_parameters": 0}], "edges": [["norm_layer", "cloud_layer"], ["input_9", "cloud_layer"], ["cloud_layer", "model_18"], ["cloud_layer", "model_18"], ["model_18", "dense_4"], ["model_18", "dense_4"], ["dense_4", "leaky_re_lu_4"], ["dense_4", "leaky_re_lu_4"]]}