{"format": "keras", "nodes": [{"name": "input_2", "id": "input_2", "class_name": "InputLayer", "output_shape": [[null, 64, 64, 4]], "num_parameters": 0}, {"name": "cloud_layer", "id": "cloud_layer", "class_name": "CloudsLayer", "output_shape": [null, 64, 64, 4], "num_parameters": 0}, {"name": "model", "id": "model", "class_name": "Functional", "output_shape": [null, 576], "num_parameters": 186272}, {"name": "dense", "id": "dense", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 577}, {"name": "leaky_re_lu", "id": "leaky_re_lu", "class_name": "LeakyReLU", "output_shape": [null, 1], "num_parameters": 0}], "edges": [["cloud_layer", "model"], ["input_2", "model"], ["model", "dense"], ["model", "dense"], ["dense", "leaky_re_lu"], ["dense", "leaky_re_lu"]]}