{"format": "keras", "nodes": [{"name": "input_4", "id": "input_4", "class_name": "InputLayer", "output_shape": [[null, 64, 64, 4]], "num_parameters": 0}, {"name": "norm_layer", "id": "norm_layer", "class_name": "TrainingTimeNormalization", "output_shape": [null, 64, 64, 4], "num_parameters": 9}, {"name": "cloud_layer", "id": "cloud_layer", "class_name": "CloudsLayer", "output_shape": [null, 64, 64, 4], "num_parameters": 0}, {"name": "model_4", "id": "model_4", "class_name": "Functional", "output_shape": [null, 576], "num_parameters": 186272}, {"name": "dense_1", "id": "dense_1", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 577}, {"name": "leaky_re_lu_1", "id": "leaky_re_lu_1", "class_name": "LeakyReLU", "output_shape": [null, 1], "num_parameters": 0}], "edges": [["norm_layer", "cloud_layer"], ["input_4", "cloud_layer"], ["cloud_layer", "model_4"], ["cloud_layer", "model_4"], ["model_4", "dense_1"], ["model_4", "dense_1"], ["dense_1", "leaky_re_lu_1"], ["dense_1", "leaky_re_lu_1"]]}