{"format": "keras", "nodes": [{"name": "input_21", "id": "input_21", "class_name": "InputLayer", "output_shape": [[null, 64, 64, 4]], "num_parameters": 0}, {"name": "cloud_layer", "id": "cloud_layer", "class_name": "CloudsLayer", "output_shape": [null, 64, 64, 4], "num_parameters": 0}, {"name": "model_46", "id": "model_46", "class_name": "Functional", "output_shape": [null, 576], "num_parameters": 186272}, {"name": "dense_7", "id": "dense_7", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 577}, {"name": "leaky_re_lu_7", "id": "leaky_re_lu_7", "class_name": "LeakyReLU", "output_shape": [null, 1], "num_parameters": 0}], "edges": [["cloud_layer", "model_46"], ["input_21", "model_46"], ["model_46", "dense_7"], ["model_46", "dense_7"], ["dense_7", "leaky_re_lu_7"], ["dense_7", "leaky_re_lu_7"]]}