{"format": "keras", "nodes": [{"name": "input_layer", "id": "input_layer", "class_name": "InputLayer", "output_shape": [[null, 64, 64, 4]], "num_parameters": 0}, {"name": "conditional_noise_layer_10", "id": "conditional_noise_layer_10", "class_name": "ConditionalNoiseLayer", "output_shape": [null, 64, 64, 4], "num_parameters": 0}, {"name": "preproc_norm", "id": "preproc_norm", "class_name": "TrainingTimeNormalization", "output_shape": [null, 64, 64, 4], "num_parameters": 9}, {"name": "clouds_layer_10", "id": "clouds_layer_10", "class_name": "CloudsLayer", "output_shape": [null, 64, 64, 4], "num_parameters": 0}, {"name": "model_4", "id": "model_4", "class_name": "Functional", "output_shape": [null, 576], "num_parameters": 186272}, {"name": "dense_2", "id": "dense_2", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 577}, {"name": "leaky_re_lu_2", "id": "leaky_re_lu_2", "class_name": "LeakyReLU", "output_shape": [null, 1], "num_parameters": 0}], "edges": [["input_layer", "conditional_noise_layer_10"], ["conditional_noise_layer_10", "preproc_norm"], ["preproc_norm", "clouds_layer_10"], ["clouds_layer_10", "model_4"], ["model_4", "dense_2"], ["dense_2", "leaky_re_lu_2"]]}